Repository: reefboericke/Logic-Simulator
Catalog: locale/*.po
Languages: de

source: No signal
de: Kein Signal

source: Logic Simulator
de: Logiksimulator

source: &Open
de: &Öffnen

source: &About
de: &Über

source: &Exit
de: &Ausgang

source: &File
de: &Datei

source: Number of Cycles
de: Anzahl der Zyklen

source: Run
de: Lauf

source: Continue
de: Fortsetzen

source: Add Monitor
de: Monitor hinzufügen

source: Open file
de: Datei öffnen

source: Run/Continue
de: Ausführen/Weiter

source: Switches
de: Schalter

source: On
de: Auf

source: Off
de: Aus

source: File
de: Datei

source: Boernashly Logic Simulator Created by Reef Boericke,
de: Boernashly Logik Simulator Erstellt von Reef Boericke,

source: Joe Nash, and Finn Ashley 2021
de: Joe Nash und Finn Ashley 2021 (Random chars: αΔδΘθ)

source: About Logsim
de: Über Logsim

source: You must have at least 1 monitor
de: Sie müssen mindestens 1 Monitor haben

source: Open bna file
de: bna-Datei öffnen

source: Errors logged in error_report.txt
de: In error_report.txt protokollierte Fehler

source: Invalid number of inputs to gate.
de: Ungültige Anzahl von Eingängen zum Gate.

source: Invalid clock period.
de: Ungültige Taktperiode.

source: Invalid initial switch value.
de: Ungültiger anfänglicher Schalterwert.

source: Incorrect number of arguments supplied for device.
de: Falsche Anzahl von Argumenten für das Gerät angegeben.

source: Incorrect argument provided for gate.
de: Falsches Argument für Gate angegeben.

source: Incorrect argument provided for clock.
de: Falsches Argument für Uhr angegeben.

source: Incorrect argument provided for switch.
de: Falsches Argument für Schalter angegeben.

source: Invalid device name.
de: Ungültiger Gerätename.

source: Two devices assigned same name.
de: Zwei Geräte haben denselben Namen.

source: Left side of a connection must be an output.
de: Die linke Seite einer Verbindung muss ein Ausgang sein.

source: Right side of a connection must be an input.
de: Die rechte Seite einer Verbindung muss ein Eingang sein.

source: Output not specified DTYPE device.
de: Ausgabe nicht angegeben DTYPE-Gerät.

source: Unexpected output specified for non-DTYPE device.
de: Unerwartete Ausgabe für Nicht-DTYPE-Gerät angegeben.

source: Invalid input name for device.
de: Ungültiger Eingabename für Gerät.

source: Multiple outputs connected to input.
de: Mehrere Ausgänge mit Eingang verbunden.

source: All gate inputs must be connected.
de: Alle Gate-Eingänge müssen verbunden sein.

source: No device with specified name.
de: Kein Gerät mit dem angegebenen Namen.

source: Monitor already connected to specified device.
de: Monitor bereits mit dem angegebenen Gerät verbunden.

source: Specified device doesn't exist.
de: Das angegebene Gerät ist nicht vorhanden.

source: a valid input
de: eine gültige Eingabe

source: device variable
de: Gerätevariable

source: non-negative integer
de: nicht negative ganze Zahl

source: a device
de: Ein Gerät

source: "begin"
de: “Start”

source: "monitors"
de: “überwacht”

source: a name
de: ein Name

source: "end"
de: “Ende”

source: "connections"
de: “Verbindungen”

source: "devices"
de: “Geräte”

source: Error on line
de: Fehler in der Leitung

source: Invalid syntax, expected
de: Ungültige Syntax, erwartet

source: or
de: oder

source: Semantic Error in file: All gate inputs must be connected.
de: Semantischer Fehler in Datei: Alle Gate-Eingänge müssen verbunden sein.

source: Syntax error in file: Comment has not been closed.
de: Syntaxfehler in Datei: Kommentar wurde nicht geschlossen.

source: Semantic
de: Semantik

source: Minimize
de: Minimieren

source: Zoom
de: Zoomen

source: Bring All to Front
de: Bringen Sie alle nach vorne

source: Display Options
de: Anzeigeoptionen

source: Toggle 3D Display
de: 3D-Anzeige umschalten

source: Reset Display
de: Anzeige zurücksetzen

source: Incorrect argument provided for signal generator device,
de: Falsches Argument für Signalgeneratorgerät angegeben,

source: Invalid waveform for signal generator device,
de: Ungültige Wellenform für Signalgeneratorgerät,

source: must consist of 0s and/or 1s.
de: muss aus 0 und/oder 1 bestehen.
